package serialisation;

public class Serrialisation {
    // Серриализация - процесс перевода какой-либо структуры данных в последовательность битов.
    // Обратныая операцмя - десериализация - восстановления начального состояния структуры данных из битовой
    // последовательности

    // Сериализация используется для передачи объектов по сети и для сохранения их в файлы

    // для сериализации используется java.io.ObjectInputStream
    // java.io.ObjectOutputStream
    // readObject() & writeObject()
    // Сериализуемый класс должен реализовать интерфейс - маркер(интерфейс без метода) java.io.Serializable - отмечает класс как сериализуемый
    //
}
